<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"f3a28749aaeaecdda60cc7d6bd58e4eb4f5a677be03ac503579d502b100a0cdb","plan_job_ref":"Job Create Terraform plan (DEV) #58 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14982497814","plan_out_hash":"f3a254c4dc3f59f20d35865bf9a69e4289e3d19c0a7399567fb36d8ba519ca73","plan_hash":"2f3434d44fb6549e977d04fc7c63bfdaa7d434920ccef15da17adca79b6a1305","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/openmrs/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.openmrs will be created
+   resource "helm_release" "openmrs" {
+       atomic                     = false
+       chart                      = "openmrs"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "openmrs"
+       namespace                  = "openmrs"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "oci://registry-1.docker.io/openmrs"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ---
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-backend"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-frontend"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "latest"
                    repository: "openmrsdevacr.azurecr.io/openmrscore-gateway"
                
                  service:
                    type: ClusterIP
                    port: 80
                
                  ingress:
                    enabled: true
                    className: "webapprouting.kubernetes.azure.com"
                    annotations: {}
                    rules:
                      - http:
                          paths:
                            - path: /
                              pathType: Prefix
                    tls: []
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.5"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #58](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14982497814)